<?php
class ErrInfo {
	public $errCode = array(
		"1"=>"操作成功完成",
		"-1"=>"数据库连接失败",
		"-2"=>"获取验证码失败",
		"-3"=>"不存在的openId",
		"-4"=>"插入新openId失败",
		"-5"=>"手机号和身份证号与预留的不匹配",
		"-6"=>"生成验证码失败",
		"-7"=>"输入的验证码不正确",
		"-8"=>"更新员工openId失败",
		"-9"=>"更新员工openId失败，请勿重复注册",
		"-10"=>"获取员工详细数据失败",
		"-11"=>"员工未注册，请先进行员工注册",
		"-12"=>"查询品牌信息列表失败",
		"-13"=>"上传图片失败",
		"-14"=>"新建验收单失败",
		"-15"=>"插入验收单详细信息失败",
		"-16"=>"通过员工id获取验证码失败",
		"-17"=>"验证码不正确",
		"-18"=>"发送短信验证码失败",
		"-19"=>"新建上架单失败",
		"-20"=>"新建报损/买赠失败",
		"-21"=>"新建货品陈列失败",
	    "-22"=>"清除已提交每日报数失败",
	    "-23"=>"插入每日报数详细信息失败",
	    "-24"=>"新建每日报数失败"
	);

	public function getErrInfoByCode($code) {
		return $this->errCode["$code"];
	}
}

?>